client/results/rq2/h1/stresstest/client_16/summary.txt
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 14.17s, 3529.71 req/s, 15.47MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      405us     31.50ms      4.14ms      2.45ms    74.89%
time for connect:     7.43ms     30.74ms     19.31ms      6.78ms    68.75%
time to 1st byte:    14.97ms     49.06ms     30.98ms      9.69ms    68.75%
req/s           :     220.63      299.98      244.51       31.44    87.50%